{
  "sections": {
    "about": "About",
    "work": "Work Experience",
    "education": "Education",
    "skills": "Skills",
    "projects": "Projects"
  },
  "buttons": {
    "print": "Print",
    "website": "Personal Website"
  },
  "resume": {
    "name": "Malik Aghiles Tahir",
    "about": {
      "general": "Full Stack Engineer focused on building scalable and elegant solutions",
      "bitcoin": "Full Stack Engineer focused on promoting Bitcoin adoption"
    },
    "location": "Montreal, Canada, EST (UTC-5) 🇨🇦",
    "locationLink": "https://www.google.com/maps/place/Montreal,+QC,+Canada/",
    "summary": {
      "general": "I am a Full Stack Engineer and recent Computer Science graduate with a deep-rooted entrepreneurial mindset. With a year of enriching internship experience followed by a year as a junior to mid-level software engineer, my journey has been marked by constant skill enhancement in programming since 2021. Currently, I work mostly with JavaScript, React, Node.js, and MongoDB. I have 3 years of experience working on a wide variety of projects",
      "bitcoin": "My journey into the world of Bitcoin began in 2016, captivated by its potential to empower individuals and foster financial freedom. This fascination ignited a passion that led me to co-found MiningX, where I gained firsthand experience in the technical and operational aspects of Bitcoin mining. Driven by the desire to contribute more directly to this revolutionary technology, I embarked on a path of software development, honing my skills with the ultimate goal of returning to the Bitcoin ecosystem. Now, equipped with 3+ years of experience as a full-stack engineer and a deep understanding of front-end technologies like TypeScript and React, I'm ready to build innovative solutions that advance the Bitcoin movement."
    },
    "education": [
      {
        "school": "Concordia University",
        "degree": "Bachelor's Degree in Computer Science",
        "start": "2018",
        "end": "2023"
      }
    ],      
    "work": [
      {
        "company": "HolderScan",
        "link": "https://holderscan.com/",
        "badges": ["React", "TypeScript", "Next.js", "Zustand", "SCSS"],
        "title": "Frontend Engineer",
        "start": "Jan 2025",
        "end": "Present",
        "description": "As the principal Frontend Engineer, I lead the planning and implementation of all new frontend features for this cryptocurrency token holder tracking platform. I'm responsible for creating a coherent design system to ensure consistent user experience across the platform, while systematically eliminating technical debt to improve code maintainability and performance. My work focuses on building scalable React components with TypeScript, managing application state with Zustand, and delivering a responsive, modern interface that serves thousands of crypto enthusiasts tracking real-time holder data."
      },
      {
        "company": "Geyser Fund",
        "link": "https://geyser.fund/",
        "badges": ["React", "Typescript", "GraphQL", "Prisma", "Postgres"],
        "title": "Full Stack Engineer",
        "start": "March 2024",
        "end": "October 2024",
        "description": "I spearheaded the front-end development of their innovative crowdfunding platform, collaborating closely with the CTO and fellow developers to create a seamless and engaging user experience. I was instrumental in the platform's redesign, enhancing its visual appeal and user-friendliness while ensuring its scalability and performance. My contributions were driven by a deep understanding of front-end technologies like TypeScript and React, and a commitment to delivering high-quality solutions that align with Geyser Fund's mission to accelerate Bitcoin adoption."
      },
      {
        "company": "Activix Inc.",
        "link": "https://www.activix.ca/en",
        "badges": ["Vue.js", "Laravel", "PostgreSQL"],
        "title": "Full Stack Engineer",
        "start": "Aug 2021",
        "end": "Sep 2022",
        "description": "Following the CTO's lead, my colleague and I implemented security enhancements by segregating user and admin roles, fortifying platform integrity. Implemented a CRM feature for accurate car image matching to leads' specs. Refactored legacy code following single responsibility principles and Lucid architecture, elevating system efficiency. My approach to problem-solving involved in-depth root cause analysis. I ensured robust CI/CD processes by creating comprehensive unit tests for each new feature. Collaborated with the CTO to integrate a third-party data analysis tool, enhancing clients' business insights and milestone tracking"
      },
      {
        "company": "SnapX",
        "link": "",
        "badges": ["Blade", "Laravel"],
        "title": "Intern - Full Stack Engineer",
        "start": "May 2020",
        "end": "Nov 2020",
        "description": "Localizing website content from English to French using PHP Laravel. Skilled in data scraping with Scrapy and Beautiful Soup, I compiled critical datasets. Played a key role in integrating PayPal payments and supported senior developers in billing process implementation."
      },
      {
        "company": "Lockheed Martin",
        "link": "https://www.lockheedmartin.com/",
        "badges": ["Java", "Spring", "Jenkins", "SVN"],
        "title": "Intern - Software Engineer",
        "start": "Jan 2020",
        "end": "Apr 2020",
        "description": "Revitalized video recording tool by upgrading its streaming codec. Conducted in-depth research on container technologies, influencing shift from VMs. Excelled in debugging, resolving critical issues through thorough root cause analysis"
      },
      {
        "company": "Mining X",
        "link": "",
        "badges": [],
        "title": "Co-Founder",
        "start": "Jan 2018",
        "end": "Jan 2019",
        "description": "As co-founder of MiningX, I spearheaded the development and optimization of our mining infrastructure, from hardware and software configuration to troubleshooting and maintenance. I also played a key role in market analysis, supplier engagement, and customer education, delivering presentations on blockchain and Bitcoin technology. Additionally, I collaborated with Catallaxy RCGT on the design and execution of client-specific mining projects."
      }
    ],
    "projects": [
      {
        "title": "Forward 360",
        "techStack": [
          "Side Project",
          "MongoDB",
          "Express",
          "Vite",
          "React",
          "Node.js",
          "AdminJs"
        ],
        "description": "A logistics platform for the 21st century. Provides a simple and intuitive way to manage your logistics.",
        "link": {
          "label": "forward360.com",
          "href": "https://forward-360.netlify.app/"
        }
      },
      {
        "title": "Geyser Fund",
        "techStack": ["React", "Typescript", "Jotai", "GraphQL", "Prisma", "Postgres"],
        "description": "A crowdfunding platform aimed at accelerating bitcoin adoption using the Lightning Network.",
        "link": {
          "label": "geyser.fund",
          "href": "https://geyser.fund/"
        }
      }
    ],
    "skills": [
      "JavaScript",
      "Typescript",
      "Php/Laravel",
      "Java",
      "Vue.js",
      "React",
      "Node.js",
      "Python",
      "TensorFlow",
      "PyTorch",
      "Figma",
      "Mongoose",
      "Express",
      "MongoDB",
      "MySQL",
      "GraphQL",
      "Prisma",
      "Jotai",
      "AdminJs",
      "Postgres"
    ]
  }
}
